# Напишите программу, которая принимает на вход координаты точки (X и Y),
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

x = int(input('Введите координату x: '))
y = int(input('Введите координату y: '))

if x > 0 and y > 0:
    print(f'точка с координатами {x}:{y} находится в первой четверти плоскости')
elif x > 0 and y < 0:
    print(f'точка с координатами {x}:{y} находится во второй четверти плоскости')
elif x < 0 and y < 0:
    print(f'точка с координатами {x}:{y} находится в третьей четверти плоскости')
elif x < 0 and y > 0:
    print(f'точка с координатами {x}:{y} находится в четвертой четверти плоскости')
else:
    print(f'точка находится в начале координат')
